Repository: Ymessenger/ymessenger
Catalog: NodeApp/Resources/Views/Configuration/Index.*.resx
Languages: ru

source: Admin email
ru: E-mail администратора ноды

# AllowedRegistration
source: Administrator registration allowed
ru: Разрешена регистрация администраторов

# Blockchain
source: Blockchain data recovery
ru: Восстановление данных из blockchain

# BlockchainBlocksCount
source: Blocks count
ru: Количество блоков

# BlockchainDatabaseOptions
source: Parameters for connecting to the blockchain database
ru: Параметры подключения к базе данных blockchain

# BlockchainRecovery
source: Blockchain data recovery
ru: Восстановление данных из blockchain

source: Cancel
ru: Отмена

source: Change password
ru: Сменить пароль

# ClientsPort
source: Port for connecting users
ru: Порт для подключения пользователей

# ConfirmUsers
source: Automatically confirm users
ru: Автоматически подтверждать зарегистрировавшихся пользователей

source: Connections parameters
ru: Параметры соединений

# CurrentSMS
source: Current configs
ru: Текущие настройки

source: Databases options
ru: Параметры баз данных

# Email
source: Email client options
ru: Параметры Email-клиента

# EncryptionType.Allowed
source: Encryption allowed
ru: Шифрование полностью разрешено

# EncryptionType.NodeUsersForbidden
source: Encryption blocked for users within the node
ru: Шифрование запрещено для пользователей в рамках одной ноды

# EncryptionType.TotallyForbidden
source: Encryption is completely blocked
ru: Шифрование полностью запрещено

source: First block created at
ru: Дата генерации первого блока

# Keys
source: Encryption keys
ru: Ключи шифрования

source: Keys created at
ru: Время генерации ключей

source: Keys expired at
ru: Время истечения срока действия ключей

source: Last block created at
ru: Дата генерации последнего блока

source: License
ru: Лицензия

# LicenseCost
source: Cost
ru: Стоимость

# LicenseCreatedAt
source: License issue date
ru: Дата выдачи лицензии

# LicenseTariff
source: Tariff
ru: Тариф

source: Licensor URL
ru: URL-адрес лицензиара

# MaxDbBackups
source: Maximum number of database backups stored
ru: Максимальное количество хранящихся бекапов базы данных

# MessengerDatabaseOptions
source: Parameters for connecting to the main messenger database
ru: Параметры подключения к базе данных мессенджера

# NewKeys
source: Generate new enctypion keys
ru: Сгенерировать новые ключи шифрования

# NodeAbout
source: Node description
ru: Описание ноды

source: Node encryption type
ru: Шифрование

source: Node information
ru: Информация о ноде

source: Node name
ru: Название ноды

# NodePermanentlyDeleting
source: Delete user data in full
ru: Удалять данные пользователей полностью

# NodeRegistrationMethod
source: Registration method
ru: Способ регистрации на ноде

# NodeRouting
source: Proxy client connections from other nodes
ru: Проксирование соединений клиентов с других нод

# NodesPort
source: Port for connecting nodes
ru: Порт для подключения других нод

# NodeStartDay
source: Node start date
ru: Дата запуска ноды

# NodeStorage
source: Store files
ru: Хранение файлов

# NodeTag
source: Tag
ru: Тэг

# NodeVisible
source: Network visibility
ru: Видимость ноды в сети

# OpenStack
source: OpenStack Swift options
ru: OpenStack Swift

# PasswordSecurity
source: Password and security
ru: Пароль и безопасность

source: Push server URL
ru: URL-адрес push-сервера

# RedisServerOptions
source: Parameters for connecting to a Redis server
ru: Параметры подключения к Redis-серверу

# RegistrationMethod.EmailRequired
source: Email required for registration
ru: Для регистрации требуется email

# RegistrationMethod.NothingRequired
source: Registration without phone and without email
ru: Для регистрации ничего не требуется

# RegistrationMethod.PhoneRequired
source: Phone required for registration
ru: Для регистрации требуется телефон

# S3
source: Amazon S3 options
ru: Amazon S3

source: Save
ru: Сохранить

source: Select
ru: Выбрать

# SelectCountry
source: Select a country
ru: Выберите страну

# SMS
source: SMS service parameters
ru: Параметры SMS-сервиса

source: Support email
ru: E-mail поддержки

# Title
source: Configuration
ru: Конфигурация

# UserRegistrationAllowed
source: User registration is allowed
ru: Регистрация пользователей разрешена
